Repository: wescamp/The_Three_Elves-1.4
Catalog: po/*.po
Languages: sk

source: The Three Elves
sk: O Troch Elfoch

source: <40,160,40>The Three Elves
sk: O troch elfoch

source: TTE
sk: OTE

source: Archer
sk: Strelec

source: (Easy)
sk: (Ľahké)

source: Avenger
sk: Pomstiteľ

source: (Hard)
sk: (Ťažké)

source: Campaign Design
sk: Návrh kampane

source: Campaign Maintenance
sk: Údržba kampane

source: Viliam Bur
sk: Viliam Búr

source: Text corrections
sk: Korekcie textu

source: Anezka Bubenickova
sk: Anežka Bubeníčková

source: Also many thanks to:
sk: Taktiež veľké dík pre:

source: Db0, Elvish Pillager, Fendrin and zookeeper (yes, not capitalized)
sk: Db0, Elvish Pillager, Fendrin a zookeeper (áno, s malým Z)

source: 1) In to the swamp
sk: 1) Do močiara

source: Northern swamp is a very dangerous place, full of undead still seeking for vengence. Only a fool would go there. But now three elven soldiers are comming to these parts and a new adventure has begun.
sk: Severný močiar je veľmi nebezpečné miesto, plné nemŕtvych hľadajúcich pomstvu. Jedine blázon by sa sem vypravil. No práve teraz prichádzajú do týchto končín traja elfovia, a nová dobrodružstvo sa začína.

source: Viliam Bur and Stanislav Hoferek wish you lots of fun and succes in battle.
sk: Viliam Búr a Stanislav Hoferek Vám prajú veľa zábavy a úspechu v bojoch.

source: Johnny
sk: Jano

source: Defeat both dark sorcerers
sk: Porazíš temných čarodejníkov

source: Find hidden treasure
sk: Nájdi stratený poklad

source: Turns run out
sk: Vyprší čas

source: @Archer
sk: @Lukostrelec

source: Oh no! Nothing interesting here. Go away!
sk: Ale nie! Tu nie je nič zaujímavé. Choďte preč!

source: Your soul and the souls of these foolish peasants are nothing special, but they can serve us well. If not, there are other villages near. Too bad there is only few of them.
sk: Tvoja duša a duše týchto úbohých sedliakov nie sú nič zaujímavé, ale dobre nám poslúžia. A ak nie, tak sú tu ďalšie dediny. Škoda, že ich je už tak málo.

source: We don't have other choice than to take weapons and put your dark magic to an end. To arms, men! I know about your troops on our side of the river, and we do not fear you.
sk: Nemáme inú možnosť ako zobrať zbrane a skoncovať s Vašou čiernou mágiou. Ozbrojte sa, chlapi! Viem o vašich vojakoch na našej strane rieky, a nebojíme sa Vás.

source: What is here in front of my eyes? Are we at time? Is here something for us, too?
sk: Čo to mám pred očami? Sme tu včas? Nájde sa nejaká zábava aj pre nás?

source: I do not have any... Elves! They will become very special skeletons. Attack!
sk: Neposielal som žiadnych... elfovia! Z nich by boli veľmi špeciálne kostričky. Na nich!

source: Whoever you are, help us! We will give you all our gold.
sk: Nech ste ktokoľvek, pomôžte nám! Dáme Vám všetko naše zlato.

source: It looks promising. How much gold have you got?
sk: To neznie zle. Koľko toho zlata máte?

source: All of you are going to die! You will be my slaves for long centuries!
sk: Všetci pomriete! Budete mojimi otrokmi po dlhé storočia!

source: Few fools in black and treasure ahead of us! Let the fun begin!
sk: Pár bláznov v čiernom a poklad pred nami. Roztočme to!

source: Don't run into the hardest battle, any you will have a good chance to survive. Remember, your attack is stronger, when fighting close to Merhil. Dark sorcerers have a powerful attack. Maybe I can slow them with my magic attack first.
sk: Neutekaj do najtvrdších bojov, a budeš mať veľkú šancu, že sa Ti podarí prežiť túto bitku. Nezabudni, tvoj útok je silnejší, keď bojuješ po boku s Merhilom. Temní čarodejníci majú mocný útok. Možno by som ich mohla najskôr spomaliť svojim špeciálnym útokom.

source: Chest was found and the undeads have been eliminated.
sk: Poklad sa našiel a nemŕtvi boli zničený!

source: Many thanks for your assistance, you will always be welcomed in our village.
sk: Veľká vďaka za vašu pomoc. Budete vždy vítaný v našej dedine.

source: Very well, farewell.
sk: V poriadku, zbohom.

source: And what about the treasure? Our half... where is it?
sk: A čo s pokladom? Naša polovica je kde?

source: We have it. Thanks for asking. Treasure is at good hands - at my hands. Want it? Come to take it!
sk: Máme ho, ďakujem za opýtanie. Poklad je v dobrých rukách - v mojich rukách. Chceš ho? Tak si poď poňho!

source: Just wait, water will go down, and armies of three villages will come to kill all of you!
sk: Však počkaj, voda poklesne a armády troch dedín prídu zabiť každého z Vás!

source: Peasants will attack us? Maybe we can swap weapons for feathers, than we don't hurt them too much.
sk: Zaútočia na nás sedliaci? To aby sme vymenili zbrane za pierka, aby sme ich príliš nezranili.

source: Don't worry, lad. We can hire enought warriors to defeat any peasant or undead.
sk: V pohode chlapče. Môžeme si najať dosť vojakov na porazenie hocijakého sedliaka či nemŕtveho.

source: These units were raised by some unskilled dark mage, they are weaker than usual.
sk: Tieto jednotky boli vyvolané neskúseným temným mágom, sú slabšie ako obyčajne.

source: Death? Do you hear me? It is NOT my time! Not yet! Arghhh!
sk: Smrť? Počuješ ma? Toto NIE JE môj čas! Ešte nie! Arghhh!

source: Now I am going to take some rest, far from these bloodhirsty beasts... farewell my friends.
sk: Idem si dopriať trochu odpočinku, ďaleko od týchto krvilačných zverov... Zbohom priatelia.

source: I am too young for such unhappy end.
sk: Som primladý pre taký smutný koniec.

source: 2) The golden chest
sk: 2) Zlatá pokladnica

source: Nameless one
sk: Bezmenný

source: Defeat Ted
sk: Porazíš Teda

source: Samin Leafstel must surrender to you
sk: Prinútiš Samina Leafstela vzdať sa

source: Death of Merhil, Nerelia, or Lahias
sk: Zomrie Merhil, Nerelia alebo Lahias

source: Time for our revenge has come! Surrender to our united forces!
sk: Čas našej pomsty nadišiel! Vzdaj sa našej spojenej armáde!

source: Oh, what about this? I will destroy your base, Nerelia the base of your east ally and Merhil... WHAT THE HELL IS THAT RANGER DOING HERE?
sk: Zaujímavé. A čo tak toto? Ja zničím tvoj hrad, Nerelia hrad tvojho východného spojenca a Merhil... ČO TU DO PEKLA ROBÍ TEN HRANIČIAR?

source: I am Samin Leafstel, and I have become a chief in one human village. It's a long story. But I am here to defeat anyone who stands against these peaceful villagers.
sk: Som Samin Leafstel, a stal som sa šéfom jednej ľudskej dediny. Ale to je dlhý príbeh. Ale prišiel som aby som porazil každého kto sa postaví proti týmto mierumilovným sedliakom.

source: Brother? What are you doing? You do not recognize us?
sk: Braček? Čo to robíš? Nespomínaš si na nás?

source: Okay, we just won again... what's up next?
sk: Tak a je tu zase ďalšie víťazstvo... a čo teraz?

source: Smash 'em, boys!
sk: Rozdrvte ich, chalani!

source: Save me!
sk: Zachránte ma!

source: Mermen from the far seas, attack!
sk: Morskí ľudia z ďalekých morí, útok!

source: Now I am going to take some rest, far from these bloodhirsty beasts... farewell my friends
sk: Idem si dopriať trochu odpočinku, ďaleko od týchto krvilačných zverov... Zbohom priatelia.

source: My friends will avenge me!
sk: Moji priatelia ma pomstia!

source: I saw a band of Undead heading this way. We must prepare ourselves!
sk: Videl som bandu nemŕtvych idúcich týmto smerom. Musíme sa pripraviť!

source: We will miss her. It wil get hard without her.
sk: Bude nám chýbať. Bude to bez nej ťažké.

source: Any last wish?
sk: Posledné želanie?

source: Let me live. I can help you. I was at the journey west to seek help of the Brotherhood of Light. They must have something against that wretched undead.
sk: Nechajte ma žiť. Môžem Vám pomôcť. Bol som na ceste do Bratstva Svetla. Určite budú mať niečo proti tým prekliatym nemŕtvym!

source: Lies. You are no longer my brother. Merhil, kill him.
sk: Klamstvá. Už nie si mojim bratom. Merhil, zabi ho.

source: Let me do it!
sk: Nechaj to na mňa!

source: Now I will cut your throat, or... maybe...
sk: Teraz Ti podrežem hrdlo, alebo... možno...

source: Maybe what?
sk: Možno čo?

source: You will become our ally in the final battle.
sk: Staneš sa našim spojencom v poslednej bitke.

source: Okay, I agree. Next time we meet, I will save YOUR life. Farewell for now. And sister, please, forgive me.
sk: Súhlasím, dohodnuté. Keď sa nabudúce uvidíme, zachránim TVOJ život. Zbohom nateraz. Sestrička, prosím, odpusť mi.

source: You are now oblidged Lahias... brother.
sk: Teraz si zaviazaný Lahiasovi... braček.

source: My village, my people! All is lost now!
sk: Moja dedina, moji ľudia! Všetko je stratené!

source: Merhil, do you hear it?
sk: Merhil, počuješ to?

source: What?
sk: Čo?

source: A storm or something... I sense a great dark energy. It is near, very near!
sk: Búrka alebo niečo... cítim silnú temnú energiu. Je to blízko, veľmi blízko!

source: It's here! I can feel it close to my body!
sk: Je to tu! Cítim to kúsok od svojho tela!

source: He disappeared. Strange, very strange. What will we do now?
sk: On sa stratil. Divné, moc divné. Čo budeme teraz robiť?

source: 3) Rise of the undead
sk: 3) Vzostup nemŕtvych

source: Company of the three elves, together with treir army, met a white mage wanderer. Combination of the holy powers and natural elvish powers changed some of the fighters in to the elvish lords.
sk: Skupina troch elfov, spoločne s ich novou armádou, stretla putujúceho bieleho mága. Kombinácia svätých síl a elfských síl povýšila niektorých vojakov na elfských šlachticov.

source: One of your fighters, Zerenhil, will be trained as:
sk: Jeden z tvojich bojovníkov, Zerenil, bude trénovaný ako:

source: Elvish Lord
sk: Elfský šľachtic

source: Alas the wanderer
sk: Pútnik Alas

source: Rebel leader Ngorok
sk: Veliteľ rebebelov Ngorok

source: Nashtok
sk: Naštok

source: Defeat lich Tar Dem Lafanar
sk: Porazíš kosteja Tar Dem Lafanara

source: Select training for your warrior Zerenhil: Elvish Highlord is a powerful infandry, effective in melee and ranged fighting. Paladin is a fast cavalry with ability to heal, but without ranged attack.
sk: Vyber tréning, ktorý dostane tvoj bojovník Zerenil: Elfský veľmož je mocná pechota, efektívna v boji na blízku i na diaľku. Palatín je rýchly jazdec so schopnosťou liečenia, no bez útoku na diaľku.

source: Elvish Highlord
sk: Elf velmož

source: Die die die!
sk: Zomri zomri zomri!

source: What Samin said? Peaceful villagers? I think that...
sk: Čo to Samin plietol? Mierumilovní sedliaci? myslím, že...

source: He don't know that they will become undead. That dark queen, who is it?
sk: On nevedel že sa z nich stanú nemŕtvy. Tá temná kráľovná, kto je to?

source: We will see when we will kill her!
sk: Uvidíme keď ju zabijeme!

source: I have an idea. We can attack Herbert with our full strengh, and than we will use his fortress!
sk: Mám nápad. Môžeme použiť všetku našu silu na rýchly útok na Herberta, a potom môžeme použiť jeho hrad!

source: Go Lahias, I will heal you. Our elvish lords are very powerful against the undead, do not let them fall!
sk: Choď Lahias, budem ťa liečiť. Naši elfský šlachtici sú veľmi silní v boji proti nemŕtvym. Nenechaj ich padnúť!

source: There are mountains in the east. Maybe it will be wise to avoid them.
sk: Na východe sú nejaké hory. Možno by sme urobili dobre, keby sme sa im vyhli.

source: Thank you. Any moment as undead was worse than hell!
sk: Ďakujem Ti. Každý moment v koži nemŕtveho bol horší ako peklo!

source: Thank you. Any moment as undead was worse than hell! Now hear me. Queen have a powerful stronghold on the north, and she is preparing a massive attack against the city of Narcifall, known as the Brotherhood of light. Stop her!
sk: Ďakujem Ti. Každý moment v koži nemŕtveho bol horší ako peklo! Teraz počúvaj. Kráľovná má mocnú pevnosť na severe, odkiaľ posiela masívnu armádu aby zaútočila na mesto Narcifall, známe ako Bratstvo svetla. Zastav ju!

source: My inner fire is weakening...
sk: Môj vnútorný oheň vyhasíňa...

source: I WILL NOT fight for your dark queen! We are strong, we do not want to fight for that silly woman!
sk: NEBUDEM bojovať za Vašu temnú kráľovnú! Sme silní, nechceme bojovať za tú blbú ženskú!

source: Any words like this mean trouble, great trouble. But pleasure for us. Warriors, kill that traitor!
sk: Každé takéto slovo znamená problém, veľký problém. Ale potešenie pre nás. Bojovníci, zabite toho zradcu!

source: I will cut you undead mouth into two pieces with my sword you... you... mindless bone creature!
sk: Rozrežem tvoju nemŕtvu hubu na dva kusy mojim mečom ty... ty... nemysliaca kostená potvora!

source: Really? Lets see. My power is growing and queen will soon kill any orc, what will stand against her!
sk: Si si istý? Však uvidíme. Moja sila sa zväčšuje a kráľovná zabije každého orka, ktorý sa proti nej postaví!

source: You are just a crazy pile of bones. Nothing more. NOTHING!
sk: Ty si len bláznivá hromada kostí a kostičiek. Nič viac. NIČ!

source: True orcs fight for the queen! You and your... ehm... army are nothing more than mindless chicken! Orcs, kill the rebel weaklings! Long live the queen!
sk: Pravý orkovia bojujú za kráľovnú! Ty a tvoja... ehm... kvázy armáda nie ste nič iné ako blbé kurčatá! Orkovia, zabite rebelujúcich slabochov! Nech žije kráľovná!

source: True. Even the peasants are more powerful than Ngorok!
sk: Tak veru. Ešte aj sedliaci sú silnejší ako Ngorok!

source: (Hmmm. They do not know about us? We can use it for our advantage.)
sk: (Hmmm. Oni o nás nevedia? Môžeme to využiť ako výhodu pre nás.)

source: Torok, son of Ngorok
sk: Torok, Ngorokov syn

source: I am here, father! Orcs, raise your weapons!
sk: Tu som otče! Orkovia, do zbrane!

source: I hope that you are not too late.
sk: D

source: Charge! Attack quickly!
sk: Rýchly útok!

source: My lord, I have collected informations about that queen.
sk: Môj pane, pozbieral som informácie o tej kráľovnej.

source: Very well. Report.
sk: Dobre, podaj hlásenie.

source: You must go with me to the Brotherhood at full speed!
sk: Musíš ísť so mnou do bratstva a to okamžite!

source: We all will go! Elves, prepare to move west!
sk: Všetci pôjdeme. Elfovia, pripravte sa na pochod na západ!

source: But what about this lich? He is fleeing! I am going after him!
sk: Ale čo s tým kostejom? Uniká! Pôjdem za ním!

source: Lahias, are you mad?
sk: Lahias, tebe už načisto preskočilo?

source: Just trust me! This is my battle, and I will kill him quickly! You all come to the brotherhood, I will wait for you there.
sk: Ver mi! Toto je môj boj a ja ho dlho naťahovať nebudem! Choďte všetci do bratstva, budem tam na Vás čakať.

source: Move Lahias to the bridge.
sk: Presuň Lahiasa na most.

source: This hills are... too silent.
sk: Tieto hory sú... príliš tiché.

source: It's a trap! Defend yourselves!
sk: Je to pasca! Kryte sa!

source: This will be a great duel. Prepare yourself, you undead beast!
sk: Toto bude veľký duel. Priprav sa, ty nemŕtva zver!

source: 4) The great march
sk: 4. Veľký pochod

source: Merhil thinks, that this city have a very powerful defences. But maybe he is wrong. And growing dark is making the march more difficult. What can be in this dark places?
sk: Merhil si myslí, že toto mesto má veľmi dobrú obranu. No možno sa mýli. Narastajúca temnota sťažuje pohyb. Čo sa môže nachádzať na týchto miestach?

source: Orcs, undead, or maybe something more...
sk: Orkovia, nemŕtvy, alebo možno niečo viac...

source: Merhil must capture a fort in the southwest.
sk: Merhil musí obsadiť pevnosť na juhovýchode.

source: Death of Merhil or Nerelia
sk: Zomrie Merhil alebo Nerelia

source: We must move west quickly, or... lava!
sk: Musíme ísť okamžite na západ, alebo... láva!

source: I don't know this parts very well, but this lava looks very unnatural. Some sorcerer was making fun.
sk: Nepoznám dobre tieto kraje, ale tá láva vyzerá veľmi neprírodne. Nejaký čarodejník ju sem dal len tak z hecu.

source: But this troll looks very natural. What about asking him about what is going on here?
sk: Ale tento trol vyzerá až príliš prírodne. Čo keby sme sa ho spýtali čo sa tu deje?

source: Are you sure that it's a good idea?
sk: Si si istá, že je to dobrý nápad?

source: He looks like one of that bad ones, but... we will see.
sk: Vyzerá ako jeden z tých zlých chlapíkov... ale však uvidíme.

source: Mr... troll, can you tell us why is this lava here?
sk: Pán... trol, môžete nám povedať, prečo je tu tá láva?

source: Halt! What you elf busine here spak quick!
sk: Stoj! Čo vy elf chcet tu hvor rýchlo!

source: We...
sk: My...

source: We are coming west to free Carcifall from orcs and undead.
sk: My putujeme na západ oslobodiť Carcifall of orkov a nemŕtvych.

source: You can no go you crash by Trug.
sk: Ty nie môcť ísť ty rozdviť od Trug.

source: We are coming west to kill that traitor Samin Leafstel.
sk: My putujeme na západ zabiť toho zradcu Samina Leafstela.

source: You can go wes.
sk: Vy môcť ísť zápd.

source: We are coming west to attack Carcifall, as dark queen commanded us.
sk: My ideme zaútočiť na Carcifall, ako nám to temná kráľovná prikázala.

source: We are here to kill all ugly trolls!
sk: Sme tu aby sme zabili všetkých hnusných trolov!

source: I have a very bad feeling about Lahias. Do you think that he is okay? Not wounded or something worse?
sk: Mám veľmi zlý pocit ohľadom Lahiasa. Myslíš, že je v poriadku? Nie je zranený alebo nebodaj niečo horšie?

source: No need to worry, he is strong and brave.
sk: Neboj nič, je silný a statočný.

source: But I do not see him. Maybe he is late. Maybe he is in a very difficult fight.
sk: Ale nikde ho nevidím. Možno sa zdržal. Možno je vo veľmi ťažkom boji.

source: Or maybe he is closer to the Narcifall then we are.
sk: Alebo je ku Narcifallu oveľa bližšie ako my.

source: Groshak
sk: Grošak

source: Tolec
sk: Tolek

source: To city, quick! Pillage all... what are this elves doing here?
sk: Do mesta, rýchlo! Všetko orabujte... čo tu robia tí elfovia?

source: Hey riders, are you friends of Ngorok?
sk: Hej jazdci, ste Ngorokovi priatelia?

source: Ngorok? Ngorok is a traitor! We are fighting for the queen.
sk: Ngorok? Ngorok je zradca! My bojujeme za kráľovnú.

source: Well, we are here to kill any servants of a queen! Kill them, elves!
sk: Tak fajn, a my sme tu preto, aby sme vyhubili jej služobníkov. Zabite ich, elfovia!

source: I am slow, too slow. Why I become an adventurer without a horse?
sk: Som pomalý, veľmi pomalý. Prečo som sa stal dobrodruhom bez koňa?

source: We are close, I can smell it!
sk: Sme blízko, cítim to!

source: We are nearly there.
sk: Už sme skoro tam.

source: 5) Party for vultures
sk: 5. Párty pre supov

source: Narcifall is under attack of the combinated forces of orcs and undead. Elves and mages prepare defenses, but it will not guard the city for long.
sk: Narcifall je pod útokom kombinovaných síl orkov a nemŕtvych. Elfovia a mágovia pripravili obranu, ale tá nevydrží tak silný útok.

source: Their only hope lies in Samin Leafstel and warriors loyal to him.
sk: Ich jediná nádej sa vkladá do Samina Leafstela a bojovníkov po jeho boku.

source: Sidonia
sk: Sidónia

source: Keril the forgotten
sk: Keril zabudnutý

source: Ghost of Navigator
sk: Duch moreplavca

source: Defend the city
sk: Obráň mesto

source: Death of Sidonia or Samin Leafstel
sk: Zomrie Sidónia alebo Samin Leafstel

source: Captain Narufel
sk: Kapitán Narufel

source: Captain Tesias
sk: kapitán Tesias

source: This city will not fall! Prepare defences!
sk: Toto mesto nepadne! Pripravte obranu!

source: This will be a difficult fight, but we have an advantage in the forests. Let's prepare our warriors close to river, and do not forget to heal wounded units.
sk: Toto bude ťažký boj, no máme výhodu v lesoch. Pripravme bojovníkov kúsok od rieky, a nezabudnime ich liečiť.

source: They are no match for wrath of elves!
sk: Nie su ničím v porovnaní s hnevom elfov!

source: Stay calm and think - they can defeat us easily in grasslands. We must lure them to terrain suitable for us.
sk: Nerob paniku a rozmýšľaj - na lúke by nás úplne dosekali. Musíme ich prilákať do terénu vhodného pre nás.

source: What type of warriors is good against the undead and what against the orcs?
sk: Aký typ bojovníkov je dobrý proti nemŕtvym a aký proti orkom?

source: Skeletons are weak against impact attacks, so against them we can use our mages. But there are too little of them left. We must make sure, that they will be healed. Elves can fight the orcs, but again, they must be healed.
sk: Kostlivci sú slabý proti tupým útokom, takže pripravte proti nim našich mágov. Ale ostalo ich už málo. Musíme sa postarať o ich liečenie. Elfovia môžu bojovať s orkami, no znovu potrebujú liečenie.

source: Captain Tesias, Captain Narufel, now you will respect orders from Samin Leafstel.
sk: Kapitán Tesias, Kapitán Narufel, odteraz spadáte pod velenie Samina Leafstela.

source: As you wish, my lady.
sk: Ako si prajete, moja pani.

source: Also we must accept, that both orcs and undead are very powerful at night and weak during the day.
sk: Taktiež musíme akceptovať, že aj orkovia aj nemŕtvy sú silní v noci a slabí cez deň.

source: We are going to infest this city!
sk: Ideme zamoriť toto mesto!

source: Never...
sk: Nikdy...

source: In the name of Samin Leafstel, remove this black plague!
sk: V mene Samina Leafstela, zničme tento čierny mor!

source: We need more warriors to defend the city!
sk: Potrebujeme viac bojovníkov na obranu mesta!

source: Maybe I can summon some of them...
sk: Možno by som mohla niekoľkých vyvolať...

source: Summoned elf
sk: Vyvolaný elf

source: And now, my most powerful one...
sk: A teraz, moje najsilnejšie...

source: What spell did that lich use against us?!?
sk: Aké kúzlo to proti nám použil?

source: I have no idea, but I dispelled it. Or not?
sk: Nemám tuešenie, ale rozplynula som to. Alebo nie?

source: Summoned knight
sk: Vyvolaný rytier

source: Come knights, kill the elves! Kill the mages! Kill all of them HA-HA-HA
sk: Poďte rytieri, zabite elfov! Zabite mágov! Zabite všetkých HA-HA-HA

source: Ancient fire of the Earth! Power of the burning flames! Show your wrath now and create a trap for this foul undead! Bur de le natia, su vere tisia, nu bere latovie terristea hius!
sk: Starodávny oheň matky Zem! Sila horiacich plameňov! Ukážte svoj hnev a vytvorte pascu pre tých úbohých nemŕtvych! Bur de le natia, su vere tisia, nu bere latovie terristea hius!

source: And about you, lich... Nar de tasimal su vere na morthipis!
sk: A pokiaľ ide o teba, kostej... Nar de tasimal su vere na morthipis!

source: Great magic, Sidonia!
sk: Super čáry-máry, Sidónia!

source: Oh, thanks.
sk: Oh, Díkes

source: Summoned Siren
sk: Vyvolaná siréna

source: Well, the placement should be better...
sk: No, umiestnenie sa tak celkom nepodarilo...

source: Reinforcements are almost here! We must fight only one a little bit more.
sk: Posily sú skoro tu! Musíme bojovať už len o chvíľu dlhšie.

source: It is over, who will now rule Carcifall?
sk: je koniec, kto bude tedaz spravovať Carcifall?

source: Our tactics was wrong. There is no hope, I failed you, elves.
sk: Naša taktika zlihala. Už nie je nádej, sklamal som vás, elfovia.

source: Oh, Brave New World!
sk: Oh, Statočný Nový Svet!

source: 6) Final assault
sk: 6. Posledný útok

source: Forces of Merhil and Samin Leafstel broke the siege of Narcifall. In that very moment, attacks of the undead and their orc friends become weak and unorganised.
sk: Armády Merhila a Samina Leafstela zlomili obliehanie Narcifallu. V tomto momente sa útoky nemŕtvych a ich orkskích priateľov stali slabé a zle organizované.
