Repository: wescamp/The_Three_Elves-1.4
Catalog: po/*.po
Languages: sk

source: Main bastion if evil is on the north, where the dark queen is preparing a new army of undead and orcs. Preparing fresh troops have only begun, and sentries delivered a message about elves.
sk: Hlavná bašta nemŕtvych je na severe, kde temná kráľovná pripravuje novú armádu nemŕtvych a orkov. Príprava nových jednotiek len začala, keď stráže doniesli informácie o elfoch.

source: Elves, mages, and rebel orcs now stand united and prepared to banish anyone who oppose them. Their powers are now great.
sk: Elfovia, mágovia a orkskí rebeli teraz stoja spoločne proti každému kto sa odváži proti nim. Ich sila je teraz obrovská.

source: But the power of a new undead leader, Lahias, are great too.
sk: Ale sila nového vodcu nemŕtvych, Lahiasa, je obrovská tiež.

source: Captain Jagr
sk: Kapitán Jágr

source: Defeat Lahias
sk: Porazíš Lahiasa

source: Death of Sidonia, Samin Leafstel or Nerelia
sk: Zomrie Sidonia, Samin Leafstel alebo Nerelia

source: Such a beautiful country!
sk: Aká nádherná krajina!

source: Yes. Forests, meadows and bands of undead north of there. Brilliant.
sk: Áno. Lesy, lúky, sem tam partia nemŕtvych na severe. Nádhera.

source: But we are goint to retake it from them, or not?
sk: Ale ideme im túto krajinu zobrať, či nie?

source: Sure. Our forces are great. And we have a new allies.
sk: Iste. naše vojsko je veľké. A máme nových spojencov.

source: Well, can you introduce them to us?
sk: No a môžeš nám ich aj predstaviť?

source: Very well. This is Trohak, son of Ngorok. He lead the rebel orcs.
sk: Takže, toto je Trohak, Ngorokov syn. Vedie rebelujúcich orkov.

source: We are no longer rebels. We are the true orcs, fighting for honor and glory. Only weak orcs are fighting for undead.
sk: Už nie sme rebeli. My sme pravý orkovia, bojujeme za česť a slávu. Len slabosi bojujú za nemŕtvych.

source: And this is Adena, the most craziest mage in these forests.
sk: A toto je Adena, najšialenejšia mágyňa týchto lesov.

source: Birds are flying over the trees.
sk: Vtáci lietajú vysoko nad stromami.

source: Fish love water.
sk: Ryby milujú vodu.

source: Hey girl, what are you drinking??
sk: hej ženská, čo to piješ?? Ponúkni aj ostatným!

source: Enought. We shall attack the undead bastion.
sk: Dosť. Mali by sme zaútočiť na baštu nemŕtvych.

source: Yeah! Orcs, make your swords ready, this time we shall broke the bones of weak cursed orcs and make a new graveyard from that undead. For honor and glory!
sk: Poďme! Orkovia, pripravte meče, tentokrát polámeme kosti prekliatych orkov a z nemŕtvych urobíme nový cintorín! za česť a slávu!

source: Rabbit like fresh carrot and fox like fresh rabbit.
sk: Králik má rád čerstvú mrkvu a líška má rada čerstvého králika.

source: Your silly forces cannot stop me! Try it, just try, and all your immortal elves will be dead. Or undead under my control! HA-HA-HA.
sk: Vaše priblblé zoskupenie amatérov ma nemôže zastaviť! Skús to, len to skús, a všetci nesmrteľný elfovia budú mŕtvy. Alebo nemŕtvy pod mojou kontrolou. HA-HA-HA

source: Lahias is that you? We must rescue him!
sk: Lahias, si to ty? Musíme ho zachrániť!

source: Rescue? What the hell are you talking about, old ugly elf witch?
sk: Zachrániť? O čom to trepeš, stará hnusná elfská bosorka?

source: We cash elf wich we kill elvs with long ers! Trolls, move add crash, bash and ma theyr bones!
sk: My driť elf korý majú dlhé ušišká! Trolovia, poďme driť, búchať a rozma ich kosť!

source: Ma? You mean maul?
sk: Rozma? Myslel si rozmliaždiť?

source: Yeees! Kil ugly stinkingy elvs!
sk: Heeeeeeej! Zabť hnusný smrdľavý elfov!

source: Assassins! To positions! No elf or foolish orc will enter the domain of our master!
sk: Zabijaci! Na miesta! Žiadny elf či zblbnutý ork nevstúpi do siene nášho pána!

source: Elite assassin
sk: Elitný zabijak

source: Spectres! Kill that mage!
sk: Prízraky! Zabite tú mágyňu!

source: Death is burning! Living see both of the shores. Death itself is begging for life. To me, mighty warriors! Show your power! Assassins will be assassinated!
sk: Smrť horí! Živí vidia obidva brehy. Smrť samotná prosí o život. Ku mne, mocný bojovníci! Ukážte svoju silu! Zabijaci budú zabitý!

source: Hungry Spider
sk: Hladný pavúk

source: Awful Spider
sk: Odporný pavúk

source: Dark Spider
sk: Temný pavúk

source: Ehm... no effect...
sk: Ehm... nič sa nedeje...

source: Ehm... What about other spells?
sk: Ehm... A čo ostatné kúzla?

source: Damn...
sk: Sakra...

source: Well, I think that it must be
sk: Dobre, myslím že by to malo byť

source: Summoned drake
sk: Vyvolaný drak

source: Better, much better!
sk: Lepšie, oveľa lepšie

source: Trees are living, trees are moving, trees are strong and very boring!
sk: Stromy sú živé, stromy sa hýbu, stromy sú silné a veľmi nudné!

source: Summoned wose
sk: Vyvolaný lesný muž

source: We are fighting a hard battle. Maybe you can help us with any spell, Sidonia.
sk: Bojujeme ťažkú bitku. Možno by si nám mohla pomôcť s nejakým kúzlom, Sidonia.

source: Help orc? Never!
sk: Pomôcť orkovi? Nikdy!

source: ARE YOU MAD? His father and brother help us greatly against undead. We will never be here without help of the brave orc warriors. Help them.
sk: TOTÁLNE TI ŠIBE V MAKOVICI? Jeho otec a brat nám veľmi pomohli proti nemŕtvym. Nikdy by sme tu neboli bez pomoci týchto statočných bojovníkov. Pomôž im.

source: Merhil is right, they made us a great service.
sk: Merhil má pravdu, veľmi nám pomohli.

source: What they said is true. My father sacrificed himself to save their lives. He was their ally. I do not lie to you, we are here to defeat undead and we need to do it together.
sk: Má pravdu. Môj otec sa obetoval aby zachránil ich životy. Bol ich spojencom. Neklamem Ti, sme tu aby sme porazili nemŕtvych spoločne.

source: I will never help you and your brutes!
sk: Nikdy nepomôžem tebe ani tvojim zverom!

source: So we have only one choice:
sk: Takže máme len jednu možnosť:

source: Sidonia, leave now. Run out of my sight!
sk: Sidónia, vypadni a už sa nikdy nevracaj. Bež mi z očí!

source: Wait. Okay Samin, I... I...
sk: Počkaj. Dobre Samin, Ja... Ja...

source: I am sorry Trohak. All my life I was fighting against orcs. I never believe that orcs will be our allies. I will summon warriors, to fight under your banner. I am really sorry.
sk: Prepáč mi to, Trohak. Celý svoj život som bojovala proti orkom. Nikdy som neverila, že by orkovia mohli byť naši priatelia. Vyvolám bojovníkov, ktorí budú bojovať pod tvojou zástavou. je mi to naozaj ľúto.

source: We are fighting together, and this is a hard battle. Summon warriors quickly, so we can clear your way to the chamber of that Death Knight.
sk: Bojujeme spoločne v tejto ťažkej bitke. Vyvolaj bojovníkov rýchlo, aby sme Vám mohli uvoľniť cestu ku kumnate rytiera smrti.

source: Enemies will burn, my master.
sk: Nepriatelia budú horieť, môj pane!

source: Yeaaaaaaaaaaaah!
sk: Fajneeeeeeeeee!

source: You orcs are much weaker than Sidonia. Go home, or die!
sk: Vy orkovia ste oveľa slabší ako Sidónia. Choďte domov, alebo skapte!

source: Come orcs, our bretheren fight against elvish traitors. Help them and kill every elf!
sk: Poďte orkovia, naši bratia bojujú proti elfským zradcom. Pomôžme im a zabime všetkých elfov!

source: You will die first! Nar de tasimal su vere na morthipis!
sk: Ty zomrieš skôr! Nar de tasimal su vere na morthipis!

source: Orcs are fleeing, both friends and enemies! I do not think that it was a wise decision.
sk: Orkovia utekajú, priateľský i nepriateľskí. Nemyslím si, že to bolo dobré rozhodnutie.

source: Do not worry, Samin. My spells are much stronger then their blades. And enemy orcs are running out of my wrath, too. Now we only need to rescue Lahias.
sk: Neboj sa, Samin. Moje kúzla sú oveľa silnejšie ako ich meče. A nepriateľskí orkovia taktiež utekajú pred mojim hnevom. Teraz potrebujeme už len zachrániť Lahiasa.

source: HA-HA! You cannot defeat me!
sk: HA-HA! Nemôžeš ma poraziť!

source: Summoned corpse
sk: Vyvolaná mŕtvola

source: Few corpses? Is it all?
sk: Zopár mŕtvoliek? To má byť všetko?

source: Do you want more? Okay, here you are!
sk: Chceš viac? Tak fajn, tu to máš!

source: I... I... feel paralised. My body is growing heavy. My power is disappearing.
sk: Ja... ja... cítim sa paralizovaná. Moje telo sa stáva ťažkým. Moja sila sa vytráca.

source: There is only one chance. Move that curse on me!
sk: Je tu len jedna možnosť. Presuň to kúzlo na mňa.

source: Are you sure?
sk: Si si istý?

source: Quickly, there is no much time!
sk: Rýchlo, nie je veľa času!

source: AAAAARGH! It is a great pain. I think that it bursting my body into pieces. My journey ends he...
sk: AAAAAAAARGH! To je ale bolesť. Myslím, že mi to trhá telo na kusy. Moja púť tu skončila...

source: He is dead! Merhil is dead!
sk: Je mŕtvy! Merhil je mŕtvy!

source: Merhil sacrifieced himself and saved your life. Come, we must rescue Lahias from his undead body, faster then he kill more elves!
sk: Merhil sa obetoval a zachránil Ti život. Poďme, musíme zachrániť Lahiasa z jeho nemŕtveho tela, rýchlejšie ako zabije viac elfov!

source: Citizens of Carcifall are sending 100 gold to each of us.
sk: nan su faleh ternista, la fel mer hil tufewea!

source: Maybe some magic can help us reach that chamber quickly... nan su faleh ternista, la fel mer hil tufewea!
sk: Možno by nám nejaká mágia pomohla dostať sa do tej komnaty rýchlejšie... nan su faleh ternista, la fel mer hil tufewea!

source: I also know one spell. Sure, my spells are not as good as yours, sister, but now I can try it. Let the light shine in the deepest caves! Narum al lumium, terri les minum!
sk: Tiež poznám jedno kúzlo. Samozrejme, moje kúzla nie sú také dobré ako tvoje, sestrička, ale skúsiť to môžem. Nech sa svetlo dostane do najhlbších jaskýň! Narum al lumium, terri les minum!

source: Damn that light. I like dark, darkness, night! Not something like this!
sk: Sakra aj so svetlom, milujem temno, temnotu, nic! Nie niečo takéto!

source: Summoned dragon
sk: Vyvolaný drak

source: I am sure that this dragon can help us.
sk: Som si istá, že tento drak nám pomôže.

source: World is darkening, where are my magic crannberies?
sk: Svet potemnieva. Kde sú moje magické brusnice?

source: Aaaaagh! I feel... life! Is that you, Nerelia?
sk: Aaaaagh! Cítim... život! Si to ty, Nerelia?

source: Close, very close. I am Sidonia, Sidonia Leafstel. Sister of Nerelia and Salim. And you are that one who killed the queen?
sk: Blízko, veľmi blízko. Volám sa Sidónia, Sidónia Leafstelová. Sestra nerelie a Salima. A ty si ten, kto zabil kráľovnú?

source: Orcs are now free. We will be on your side in any futher adventure!
sk: Orkovia sú teraz

source: 6) Kill the elves
sk: 6. Zabi elfov

source: Kill Sidonia
sk: Zabi Sidóniu

source: Death of Lahias
sk: Zomrie Lahias

source: Interlude2 - Good or Evil?
sk: Medzihra2 - Dobro alebo Zlo?

source: Last battle is here. Will you play the elves or undead?
sk: Posledná bitka je tu. Budeš hrať za elfov alebo nemŕtvych?

source: Capture fort with elf OR undead
sk: Obsaď pevnosť s elfom ALEBO nemŕtvym

source: To play last scenario as elf, move an elvish fighter in to the central fort.
sk: Pre hranie posledného scenára za elfov, presuň elfa vojaka do pevnosti v strede.

source: - OR -
sk: - ALEBO -

source: To play last scenario as undead, move a skeleton in to the central fort.
sk: Pre hranie posledného scenára za nemŕtvych, presuň kostlivca do pevnosti v strede.

source: Elvish army
sk: Elfská armáda

source: Undead army
sk: Nemŕtva armáda

source: Interlude - River crossing
sk: Medzihra - Križovanie rieky

source: Lahias is on his own quest - to kill one of the liches. Will be able to avoid death?
sk: Lahias plní svoju vlastnú úlohu - zabiť jedného z kostejov. Podarí sa mu uniknúť smrti?

source: Taste my steel! Rest in pieces! You cannot avoid death, lich!
sk: Vyskúšaj moju oceľ! Odpočívaj v malých kúskoch! Nemôžeš sa vyhnúť smrti, kostej!

source: Death? HA-HA-HA
sk: Smrť? HA-HA-HA

source: Maybe it can be wise to wait for dawn. Attack skill of that lich will be much weaker during day.
sk: Možno by bolo múdre počkať na svitanie. Útok toho kosteja bude oveľa slabší cez deň.

source: This is your end, lich!
sk: Toto je tvoj koniec, kostej!

source: What? What has happening to me? Aaaaaargh! Everything hurts! I... I... I feel the dark energy!
sk: Čože? Čo sa to so mnou deje? Aaaaaaaaargh! Všetko ma bolí! Ja... Ja... ja cítm temnú energiu!
